package com.example.islamics.estakem.ui

import android.content.Intent
import android.content.SharedPreferences
import android.support.v7.app.AppCompatActivity
import android.os.Bundle
import android.view.View
import com.example.islamics.estakem.R
import kotlinx.android.synthetic.main.activity_sala.*
import java.util.*

class SalaActivity : AppCompatActivity() {
    var myshared: SharedPreferences? = null
    var myshared1: SharedPreferences? = null

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_sala)


        var s: String? = intent.extras?.getString("fareda_name") // the prayer name

        // control the text displayed with respect to name

        //farayed
        when (s) {
            "الصلاوات الخمس" -> {
                definition.text = "يقول الله جل وعلا في كتابه المبين:( وَأَقِيمُوا الصَّلَاةَ وَآتُوا الزَّكَاةَ وَارْكَعُوا مَعَ الرَّاكِعِينَ )[البقرة:43] \n" +
                        "في آيات كثيرات يأمر فيها سبحانه بإقامة الصلوات، وما ذاك إلا لعظم شأنها وكونها عمود الإسلام كما جاء في الحديث عنه عليه الصلاة والسلام أنه قال:\"رأس الأمر الإسلام، وعموده الصلاة، وذروه سنامه الجهاد في سبيل الله، وصح عنه عليه الصلاة والسلام أنه قال: أول ما يحاسب عليه العبد من عمله صلاته، فإن صلحت فقد أفلح وأنجح، وإن فسدت فقد خاب وخسر\"."
            }
            "صيام رمضان" -> {
                definition.text = "قال تعالى: (يَا أَيُّهَا الَّذِينَ آمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ، أَيَّامًا مَعْدُودَاتٍ فَمَنْ كَانَ مِنْكُمْ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِنْ أَيَّامٍ أُخَرَ)\n" +
                        "\n" +
                        "ذُكِر عن النبيّ - صلّى الله عليه وسلّم - في فضائل شهر رمضان ما رواه عنه أبو هريرة - رضي الله عنه - حيث قال: (إذا جَاءَ شَهرُ رمضانَ فُتِحَت أبوابُ الجنّةِ وغُلِّقت أبوابُ النارِ وصُفِّدَت الشيَاطينُ)؛ ففي هذا الشهر تُفتح أبوابُ الجنّةِ لكثرة الأعمال الصالحة التي يَتّقربُ بها العبد إلى الله عزَّ وجل، والتي تكون سَبباً في دخوله الجنة، وفيه تُغلقُ أبوابُ النار، لبُعد العبد عن فعل المعاصي والآثام التي تُغضِبُ الله تعالى، وتكونُ سبباً في دخوله النار، وكأن الله عزَّ وجل بفعله هذا وإعلان النبي - صلّى الله عليه وسلّم - لهذا الحديث ما هو إلاّ تشجيعٌ للعباد لتكثير فعل الطاعات، وأعمال الخير، التي يضاعف أجرها في رمضان، وحافزاً للبعد عن المَعاصي والآثام وتجنّب فعلها والقيام بها في هذا الشهر؛ لأنّ الشياطين تُصفّد وتُوثق فلا تستطيع إغواء العبد بفعل المعاصي كما تفعل في باقي الشهور. من فضائل هذا الشهر أيضاً مُضاعفة الحسنات؛ حيثُ إنّ النافلة فيه تَعدلُ أجرَ الفريضة، والفريضةُ تَعدِلُ فيه أجر سبعين فريضة؛ ولذلك كان الصحابة -رضوان الله عليهم- يَستبشرون ويفرحون لقُدومِ شهر رمضان، ويَحمدون الله لبلوغهِ، ويسألونه عزّ وجل العونَ على صيامه وقيامه وفعل صالح الأعمال فيه."
            }
            "طلب العلم" -> {
                definition.text = "طلب العلم طريقٌ يهيّؤه الله لعبده حتى يصل به إلى الجنة، فقد رُوي عَنْ أَبِي هُرَيْرَةَ -رضي الله عنه- عن رَسُولُ اللهِ -صلى الله عليه وسلم- أنّه قال: ( .. مَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ ..).[٦] بطلب العلم ينال المسلم ويكسبُ خشية الله ومخافته، ويوصله علمه إلى التواضع للخَلق ولين الجانب لهم وبسط يد الرحمة والمحبة بينهم، قال تعالى: (إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ إِنَّ اللَّهَ عَزِيزٌ غَفُورٌ).[٧] أجر طلب العلم يبقى حتى بعد انقطاعِ عمل الإنسان بانتهاء أجله، فعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ -صلى الله عليه وسلم- قَالَ: (إذا ماتَ الرجلُ انقطعَ عملُهُ إلَّا من ثلاثٍ ولدٍ صالحٍ يدعو لَهُ، أو صدقةٍ جاريةٍ أو علمٍ يُنتَفعُ بِهِ).[٨] طالب العلم ينال رفعةٌ في الدُّنيا ومنزلةً خاصةً في الآخرة؛ قال تعالى: ﴿ ... يَرْفَعِ اللهُ الَّذِينَ آمَنُوا مِنكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ وَاللهُ بِمَا تَعْمَلُونَ خَبِيرٌ﴾،[٩]. كما قال تعالى في سورة الزمر: (قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُوْلُو الْأَلْبَابِ)[١٠]. طلب العلم الشرعي دليلٌ على خيريّةِ العبدِ، وأنّ الله قد اصطفاه بأن يسّر له طلب العلم؛ خصوصاً علم الفقه وسائر العلوم الشرعية الأخرى على وجه الخصوص، فقد ثبت عن النَّبِيُّ -صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ- أنّه قال: (مَن يُرِدِ اللهُ به خيرًا يُفقِّهْه في الدِّينِ).[١١]"
            }
            "بر الوالدين" -> {
                definition.text = "قال سبحانه وتعالى:\" وَقَضَى رَبُّكَ أَلاَّ تَعْبُدُوا إِلاَّ إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا إِمَّا يَبْلُغَنَّ عِنْدَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلاَهُمَا فَلاَ تَقُل لَهُمَا أُفٍّ وَلاَ تَنْهَرْهُمَا وَقُل لَهُمَا قَوْلاً كَرِيمًا وَاخْفِضْ لَهُمَا جَنَاحَ الذُّل مِنَ الرَّحْمَةِ وَقُل رَبِّي ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيراً \"، الإسراء/23 .\n" +
                        "وقد أمرنا الله سبحانه وتعالى بأن نعبده ولا نشرك به شيئاً، وقد قرن برّ الوالدين بذلك، وكلمة القضاء في الآية السّابقة جاءت بمعنى الوجوب، والإلزام، والأمر. كما أنّه سبحانه وتعالى قد قرن شكرهما بشكره في قوله سبحانه وتعالى:\" أَنِ اشْكُرْ لِي وَلِوَالِدَيْكَ إِلَيَّ الْمَصِيرُ \"، سورة لقمان، 14 ، فإنّ الشّكر لله سبحانه وتعالى يكون على نعمة الإيمان، وأمّا شكر الوالدين فيكون على نعمة التّربية الصّالحة، وقد قال سفيان بن عُيينة:\" مَنْ صَلَّى الصَّلَوَاتِ الْخَمْسَ فَقَدْ شَكَرَ اللَّهَ تَعَالَى، وَمَنْ دَعَا لِوَالِدَيْهِ فِي أَدْبَارِ الصَّلَوَاتِ فَقَدْ شَكَرَهُمَا \". وقد ورد في صحيح البخاري، عن عبد الله بن مسعود قال:\" سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيُّ الأَْعْمَال أَحَبُّ إِلَى اللَّهِ عَزَّ وَجَل؟ قَال: الصَّلاَةُ عَلَى وَقْتِهَا قَال: ثُمَّ أَيٌّ؟ قَال: بِرُّ الْوَالِدَيْنِ قَال: ثُمَّ أَيٌّ؟ قَال: الْجِهَادُ فِي سَبِيل اللَّهِ \"، رواه البخاري . فقد أخبرنا النّبي - صلّى الله عليه وسلّم - أنّ برّ الوالدين من أفضل الأعمال بعد الصّلاة، والتي هي دعامة من دعائم الإسلام. وقد قدّم الرّسول - صلّى الله عليه وسلّم - برّ الوالدين في الحديث على الجهاد، حيث أنّ برّ الوالدين فرض عين، ولا ينوب عنه فيه أحد آخر"
            }
            "صلاة الجمعة علي وقتها" -> {
                definition.text =
                        "في الشريعة الإسلامية العديد من الصلوات منها ما هو فرض ومنها ما هو سنة عن رسولنا الكريم، ومن أهمّ الصلوات المفروضة على المسلمين بجميع أنحاء العالم صلاة الجمعة، التي تقام كل جمعة بوسط النهار وقت صلاة الظهر، وتتكون صلاة الجمعة من الخطبة الأولى ومن ثمّ استراحة، وبعدها الخطبة الثانية الذي يلقيها خطيب الجامع المتميّز بالمعرفة الدينية الصحيحة والمدروسة صلاة الجمعة هي صلاة جهريّة تتكوّن من ركعتين فقط، وقد ذكرت بالقرآن الكريم بشكل صريح، فقال الله عز وجل في كتابه العظيم : \"يَا أَيُّهَا الَّذِينَ آَمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (9) فَإِذَا قُضِيَتِ الصَّلَاةُ فَانْتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ وَاذْكُرُوا اللَّهَ كَثِيرًا لَعَلَّكُمْ تُفْلِحُونَ (10) وَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ وَاللَّهُ خَيْرُ الرَّازِقِينَ\"(الجمعة)، لذلك يجب ترك البيع والعمل والذهاب للصلاة، أمّا إن كان المسلم مريض، فلا حرج عليه إن لم يذهب."
            }
            "قراءة القرآن" -> {
                definition.text = "(الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ)\n" +
                        "\n" +
                        "القرآن الكريم نور رب العاملين، ورحمته المهداة للعالمين، قراءته عبادة، والتفكُّر \n" +
                        "في آياته عبادة، والعمل بمقتضى أحكامه واجب، وللمسلم عهد مع القرآن الكريم ينبغي أن يكون، فيغترف من فيض هداه يوميَّاً، فهو الطاقة المتجددة، والعطاء والخير الذي لا ينضب، فمن حسن برُّ المسلم بكتاب ربه، تجديد عهده معه بشكل يومي، فلا يكون له هاجراً ولا لأحكامه معطلاً، وانتظام المسلم بتلاوة القرآن الكريم بشكل يومي، يترتب عليه آثار عظيمة النفع على المسلم، نفسيَّة هي وجسديَّة، فقد وصفه الله سبحانه بأنّه شفاء لما في الصدور، ويترتب على هجره آثار سيئة، فهناك إذاً تصوُّر للعلاقة الجيِّدة التي ينبغي أن تكون مع كتاب الله عز وجل.\n"
            }
            "الزكاة" -> {
                definition.text = "الزكاة لغة هي النماء والطهارة والزيادة، وقيل إنّها سميت زكاةً لأنّه يرجى بها زيادة المال ونماؤه وطهارته، ولأنها تنمي الأجر أيضاً، قال تعالى: (خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِمْ بِهَا)، أما شرعاً فالزكاة هي حق واجب في مال مخصوص يخرج لطائفة مخصوصة، في أوقات مخصوصة.\n" +
                        "\n" +
                        "من شروط الزكاة الآتي \n" +
                        "الإسلام: يجب أن يتحقق شرط الإسلام فلا تجب الزكاة على الكافر، كما أنّها لا تصح منه\n" +
                        "الحرية: كون المملوك لا مال له، وإن ملك مالاً فيرجع إلى سيده في نهاية الأمر.\n" +
                        "ملك النصاب: أي أن يملك المسلم من المال ما يبلغ النصاب المقدّر شرعاً، ويختلف النصاب باختلاف نوع المال\n" +
                        " حولان الحول: أي مضّيه، ويستثنى من الحول ثلاث أشياء هي: أرباح التجارة، والمعشرات، ونتائج السائمة\n" +
                        "\n" +
                        "من مصارف الزكاة الآتي:\n" +
                        "الفقراء والمساكين: في حالهم تفاوت، الفقراء أشد حاجة من المساكين، كونه لا يجد ما يعيله وأهله لمدّة نصف سنة، أما المساكين فإنّ حالهم أعلى من الفقراء فلا يجدون كمال الكفاية وإنّما يجدون نصفها، فيعطون ما يدفع حاجاتهم وضرورتهم.\n" +
                        " العاملون عليها: حيث يعطون من أموال الزكاة بقدر ما يقتضيه عملهم هذا في الزكاة وما يستحقون بوصفهم هذا، أغنياء كانوا أم فقراء، فإذا استحقوا الزكاة بسبب فقرهم فيعطون من الزكاة لعمالتهم ولفقرهم.\n" +
                        " المؤلفة قلوبهم: هم ممن يكون في تأليف قلوبهم دفع شر عن المسلمين أو مصلحة لهم، كالكافر الذي يرجى إسلامه، أو المسلم الذي يرجى تقوية إيمانه، أو شرير يرجى دفع شره.\n" +
                        " الرقاب: هم إما مكاتب قد اشترى حريته أو نفسه من مالكه، أو مملوك قد اشتري من مال الزكاة بغية عتقه، أو أسير مسلم لدى الكفار فيدفع لهم من الزكاة لفك أسره. \n" +
                        "الغارمين: أي المدينين. الجهاد في سبيل الله: كالمقاتلين في سبيل الله، وما يحتاجون إليه من سلاح وقوت ونحوه.\n" +
                        " ابن السبيل: هو من نفذت نفقته وانقطع به سفره\n"

                name_text.visibility = View.INVISIBLE
                numofdays.visibility = View.INVISIBLE
                start_but.visibility = View.INVISIBLE
            }
            "صلة الأرحام" -> {
                definition.text = "تُعَدّ صلة الرحم من أفضل ما يتقرّب به العبد إلى الله -عزّ وجلّ-، وهي تُعدّ من الأمور الواجبة على كلّ مسلم، كما أنّها تحقّ له؛ وذلك بأن يصل رحمه ويصلوه، وقد ربط الله -تعالى- بين صلة الرحم، والبركة في الوقت، والرزق، وجعلها سبباً لهما، فقد قال رسول الله -صلّى الله عليه وسلّم-: (مَن أحَبَّ أنْ يُبْسَطَ له في رِزْقِهِ، ويُنْسَأَ له في أثَرِهِ، فَلْيَصِلْ رَحِمَهُ)، فيجلس المسلم مع أقاربه، ويتسامرون، ويتناقشون في المواضيع المختلفة، والمُتنوّعة، ممّا يؤدّي إلى صفاء صدر كلٍّ منهم تجاه الآخر، وزيادة الألفة والمَحبّة فيما بينهم، وتجدر الإشارة إلى أنّ الأرحام من أحقّ الناس وأولاهم بالإحسان، والرعاية، قال الله -تعالى-: (وَأُولُو الأَرحامِ بَعضُهُم أَولى بِبَعضٍ في كِتابِ اللَّـهِ)\n" +
                        " وقد كانت صلة الرحم من الأخلاق المعروفة قبل بعثة النبيّ -صلّى الله عليه وسلّم-، وعُرِف بها أيضاً، كما يتّضح ذلك من قول أم المؤمنين خديجة -رضي الله عنها- له حين نزل عليه الوحي أوّل مرّةٍ: (كَلّا واللَّهِ ما يُخْزِيكَ اللَّهُ أبَدًا، إنَّكَ لَتَصِلُ الرَّحِمَ)\n" +
                        " وكان رسول الله يمدح أرحامه، ويدعو لهم، ويُوصي بعضهم ببعضٍ، ويفخر بهم، ويقدّم لهم المساعدة المادّية، والمعنويّة، وممّا كان أنّه دعا لعبدالله بن عباس بأن يُفقِّهه الله في الدين، ويُعلّمه التأويل، ومن أجلّ وأعظم المواقف التي تدلّ على حرص الرسول على رَحِمِه ما حصل عند موت عمّه أبي طالب؛ فقد جاءه رسول الله، وكان عنده أبو جهل، وعبدالله بن المغيرة، فطلب منه الرسول أن ينطق الشهادة فأبى، ولمّا مات أراد النبيّ أن يستغفر لعمّه، روى الإمام البخاريّ قول الرسول في ذلك: (أمَا واللهِ لأستَغفِرَنَّ لكَ ما لم أُنْهَ عنكَ)،[٥] فأنزل الله قوله ناهياً عن ذلك: (ما كانَ لِلنَّبِيِّ وَالَّذينَ آمَنوا أَن يَستَغفِروا لِلمُشرِكينَ وَلَو كانوا أُولي قُربى مِن بَعدِ ما تَبَيَّنَ لَهُم أَنَّهُم أَصحابُ الجَحيمِ)\n"
            }

            //nwafel ---------------
            "السنن الرواتب" -> {
                definition.text = "تعريف السنن الرواتب هي السنن التي داوم النبيُّ عليه الصلاة والسلام عليها، ودلّ على ذلك إخبارُه بها، أو فعلُها، منها سنةُ الظهر، وسنةُ المغرب، والعشاء، وأخيراً الفجر، بالإضافة إلى سنة الجمعة، وسُمِّيت بالرواتب لمواظبة النبي عليه الصلاة والسلام عليها، وهي سنة مؤكدة، كصلاة الوتر، وصلاة الضحى، ويبلغ عدد هذه السنن اثنتي عشرة ركعة، وهي\n" +
                        " أربعُ ركعات قبل الظهر بتسليمتين، واثنتان بعد الظهر. ركعتان من بعد صلاة المغرب. ركعتان بعد صلاة العشاء. ركعتان من قبل صلاة الفجر\n" +
                        "قال رسول الله \" صلَّى اللهُ عليه وسلَّم ركعتا الفجر خير من الدنيا وما فيها\" \n" +
                        "وتقول عائشة رضى الله عنها { لم يكنِ النبيُّ صلَّى اللهُ عليه وسلَّم، على شيءٍ من النوافِلِ، أشدَّ منه تعاهُدًا على ركعتَيِ الفجرِ }\n" +
                        "عن عائشة رضي الله عنها قالت : \" كان النبي صلَّى اللهُ عليه وسلَّم  يصلي في بيتي قبلَ الظهرِ أربعًا . ثم يخرج فيصلي بالناسِ . ثم يدخل فيصلي ركعتَين . وكان يصلي بالناس المغربَ . ثم يدخل فيصلي ركعتَين . ويصلي بالناس العشاءَ . ويدخل بيتي فيصلي ركعتَين\""
            }
            "قيام الليل" -> {
                definition.text = "وقد ذكر الله عز وجل المتهجدين فقال عنهم :\" كَانُوا قَلِيلًا مِنَ اللَّيْلِ مَا يَهْجَعُونَ  وَبِالْأَسْحَارِ هُمْ يَسْتَغْفِرُونَ \" \n" +
                        "وقال تعالى:  \" أَمْ مَنْ هُوَ قَانِتٌ آَنَاءَ اللَّيْلِ سَاجِدًا وَقَائِمًا يَحْذَرُ الْآَخِرَةَ وَيَرْجُو رَحْمَةَ رَبِّهِ قُلْ هَلْ يَسْتَوِي الَّذِينَ يَعْلَمُونَ وَالَّذِينَ لَا يَعْلَمُونَ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ\"\n" +
                        "أمر الله نبيه بقيام الليل في قوله تعالى:  يَا أَيُّهَا الْمُزَّمِّلُ  قُمِ اللَّيْلَ إِلَّا قَلِيلًا  نِصْفَهُ أَوِ انْقُصْ مِنْهُ قَلِيلًا  أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآَنَ تَرْتِيلًا \n" +
                        "وقال سبحانه:  وَمِنَ اللَّيْلِ فَتَهَجَّدْ بِهِ نَافِلَةً لَكَ عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا\n" +
                        "عن عائشة رَضي اللَّه عنها أَنَّ النَّبِيَّ ﷺ كَان يقُومُ مِنَ اللَّيْلِ حتَّى تتَفطَرَ قَدمَاهُ، فَقُلْتُ لَهُ، لِمْ تصنعُ هَذَا يَا رسولَ اللَّهِ، وقدْ غفَرَ اللَّه لَكَ مَا تقدَّمَ مِنْ ذَنبِكَ وَمَا تأخَّرَ؟ قَالَ: أَفَلاَ أُحِبُّ أَنْ أكُونَ عبْداً شكُوراً؟\n" +
                        "حث النبي على قيام الليل ورغّب فيه، فقال عليه الصلاة والسلام: { عليكم بقيام الليل فإنه دأب الصالحين قبلكم، وقربة إلى الله، ومكفرة للسيئات، ومنهاة عن الإثم، ومطردة للداء عن الجسد}\n" +
                        "وقال{ أفضل الصلاة بعد الفريضة صلاة الليل }\n" +
                        "وقال صلى الله عليه وسلم { أيها الناس، أفشوا السلام، وأطعموا الطعام، وصلوا والناس نيام، تدخلوا الجنة بسلام }\n"
            }
            "الضحى" -> {
                definition.text = "صلاة الضحى، وتسمى أيضاً: صلاة الأوابين\n" +
                        "عن أبي هريرة رضي الله عنه قال قال رسول الله صلى الله عليه وسلم :  ( لا يحافظ على صلاة الضحى إلا أواب، وهي صلاة الأوابين )\n" +
                        "هي صلاة تؤدى بعد ارتفاع الشمس قيد رمح، وقيل بعد مضي ربع النهار ، وصلاة الضحى أحد أنواع صلاة النفل وحكمها أنها سنة مؤكدة عند الجمهور\n" +
                        "عن أبي هريرة قال أوصاني خليلي بثلاث :صيام ثلاث أيام من كل شهر، وركعتي الضحى، وأن أوتر قبل أن أرقد (أنام) متفق عليه\n" +
                        "عن أبي ذر قال عن النبي أنه قال: يصبح على كل سلامي من أحدكم صدقة، وأمر بالمعروف صدقة، ونهي عن المنكر صدقة، ويجزئ من ذلك ركعتان يركعهما من الضحى صحيح مسلم\n" +
                        "يقول النبي في حديث مقدسي يقول الله يا ابن ادم، لا تعجزني من أربع ركعات في أول نهارك، أكفك آخره) سنن أبي داوود وهو صحيح\n" +
                        "(عن النبي أنه قال من صلى الغَدَاةَّ في جماعة ثم قعد يذكر الله حتى تطلع الشمس، ثم صلى ركعتين، كانت له كأجر حجه، عمرة تامة،تامة، تامة) صحيح سنن ترميذي\n" +
                        "أقل صلاة الضحى ركعتين، وأفضلها أربع ركعات مثنى مثنى، أو ثمان ركعات ؛ و عند الشافعي وعن أحمد بن حنبل أن أكثرها اثنتى عشر ركعة. وعن عائشة بنت أبي بكر عند مسلم: \"كان يصلي الضحى أربعا ويزيد ما شاء\" \n" +
                        "ويستحب ان تصلى صلاة الضحى بسورتي الشمس والضحى، لحديث عقبة بن عامر قال{ أمرنا رسول الله صلى الله عليه وسلم أن نصلي الضحى بسور منها والشمس وضحاها والضحى }\n"
            }
            "التراويح فى رمضان" -> {
                definition.text = "هي الصلاة التي تصلى جماعة في ليالي رمضان، والتراويح جمع ترويحة ، سميت بذلك لأنهم كانوا أول ما اجتمعوا عليها يستريحون بين كل تسليمتين، كما قال الحافظ ابن حجر، وتعرف كذلك بقيام رمضان.\n" +
                        "صلاة التراويح أو صلاة القيام في رمضان هي صلاة في الإسلام، وحكمها سنة مؤكدة للرجال والنساء تؤدى في كل ليلة من ليالي \n" +
                        "شهر رمضان بعد صلاة العشاء ويستمر وقتها إلى قبيل الفجر، وقد حث النبي محمد  صلَّى اللهُ عليه وسلَّم  على قيام رمضان فقال:  من قام رمضان إيماناً واحتساباً غفر له ما تقدم من ذنبه. وقد صلاها رسول الله صلَّى اللهُ عليه وسلَّم  في جماعة ثم ترك الاجتماع عليها؛ مخافة أن تفرض على أمته، كما ذكرت ذلك عنه أم المؤمنين عائشة.\n" +
                        "إذا صلى العبد التراويح ووافقت هذه اللية ليلة القدر فكأنّما قام بعبادة الله عز وجل ألف شهرٍ\n"
            }
            "صيام العشر من ذى الحجة" -> {
                definition.text = "جعل الله -تعالى- للمسلمين مواسماً خاصّة للطاعات، تتضاعف فيها الأجور، وتكثر فيها الفضائل والميّزات، منها العشرة الأولى من أيام شهر ذي الحجّة، فقد فضّلها الله -تعالى- على أيام العام كلّها، وخصّها الرسول -صلّى الله عليه وسلّم- بالقول، حيث ورد عنه: (ما العملُ في أيامِ العشْرِ أفضلَ من العملِ في هذه، قالوا: ولا الجهادُ؟ قال: ولا الجهادُ، إلّا رجلٌ خرجَ يخاطِرُ بنفسِه ومالِه، فلم يرجِعْ بشيءٍ)،[١] ومن فضائل هذه الأيام وخصوصياتها أنّ الله -تعالى- أقسم بها في القرآن الكريم، وذلك حين قال: (وَالْفَجْرِ*وَلَيَالٍ عَشْرٍ)،[٢] فقال المفسّرون: أنّها عشرة ذي الحِجّة، وهي كذلك الأيام المعلومات التي شرع الله -تعالى- للمسلمين فيها الإكثار من ذكره، قال الله تعالى: (وَيَذْكُرُوا اسْمَ اللَّهِ فِي أَيَّامٍ مَّعْلُومَاتٍ)،[٣] كما أنّ يوم عرفة يأتي في هذه العشر، وهو يوم العتق من النيران، ويوم فضلٍ عظيمٍ عند المسلمين\n" +
                        "ثبت بالنصوص الشرعية الكثيرة فضل أيام عشرة ذي الحِجّة، وعِظَم الأجر المترتب على العبادة والطاعات فيها، وقد استحبّ أهل العلم صيام هذه الأيام، والمقصود بها الأيام التسعة الأولى منها فقط، أمّا اليوم العاشر وهو يوم النحر، فالصوم فيه محرّم بالاتفاق؛ فهو يومُ عيد،\n" +
                        "فقد ثبت عن النبي صلى الله عليه وآله وسلم أنه كان يصوم التسع من ذي الحجة؛ ففي \"سنن أبي داود\" وغيره عن بعض أزواج النبي صلى الله عليه وآله وسلم قالت: \"كان رسول الله صلى الله عليه وآله وسلم يصوم تسع ذي الحجة، ويوم عاشوراء، وثلاثة أيام من كل شهر أول إثنين من الشهر والخميس\".\n" +
                        "وعن حفصة رضي الله عنها قالت: \"أربع لم يكن يدعهن رسول الله صلى الله عليه وآله وسلم صيام يوم عاشوراء، والعشر، وثلاثة أيام من كل شهر، والركعتين قبل الغداة\" رواه أحمد والنسائي وابن حبان وصححه.\n"
            }
            "صيام الايام البيض" -> {
                definition.text = "الأيام البيض هي أيام محددة من كل شهر، ورد في فضلها أحاديث عن النبي محمد. وهذه الأيام هي التي توافق اليوم الثالث عشر، والرابع عشر، والخامس عشر من كل شهر من أشهر العام الهجري، وقد سُمِّيت بذلك، لتميز ليلها ببياض نور قمره، حيث يكون القمر في هذه الأيام بدرًا كاملاً، ويمكن رؤيته بالعين المجردة، وبشكل واضح، وتسمّى أيضًا بالأيّام الغرّ.\n" +
                        "وأجرها كصوم الدهر أي كصوم كل أيام السنة، عند استمرار صيام هذه الأيام، فأجر صيام ثلاث أيام يعدل صيام شهر بتضعيف الأجر، الحسنة بعشر أمثالها من غير حصول المضرَّة أو المفسدة التي في صيام الشهر كاملا. ودليلها ما رواه أبو ذر رضي الله عنه قال :أنَّ النَّبيَّ محمّدا صلّى الله عليه وسلم قال له: {إذا صمت من الشَّهر ثلاثة أيَّام، فصم ثالث عشرة، ورابع عشرة، وخامس عشرة} وفي أجرها روي عن النبي صلى الله عليه وسلم قال: صم من الشهر ثلاثة أيام، فإن الحسنة بعشر أمثالها، وذلك مثل صيام الدهر.[3] .وروي { أن النبي صلّى الله عليه وسلم كان يصوم عدة ثلاثة أيام من كل شهر}\n"
            }
            "صيام الاثنين" -> {
                definition.text = "صوم الاثنين والخميس من أنواع صوم النفل في الإسلام عن عائشة قالت { إن النبي صلَّى اللهُ عليه وسلَّم  كان يتحرى صيام الاثنين والخميس}\n" +
                        "وثبت في مشروعية استحباب صوم يومي الاثنين والخميس دليل الترغيب، وهو أن يومي الاثنين والخميس تعرض فيهما الأعمال، ووجه ذلك: أن الصوم عمل فيستحب للمسلم الصوم فيهما ليعرض عمله وهو صائم، ويدل على هذا حديث: عن أبي هريرة : أن النبي صلَّى اللهُ عليه وسلَّم  قال { تعرض الأعمال كل اثنين وخميس فأحب أن يعرض عملي وأنا صائم } كما ورد أيضا في صوم يوم الاثنين حديث: عن أبي قتادة : أن النبي صلَّى اللهُ عليه وسلَّم  سئل عن صوم يوم الاثنين فقال { ذلك يوم ولدت فيه، وأنزل علي فيه } وفي هذا دليل استحباب صوم يومي الاثنين والخميس؛ لأنهما يومان تعرض فيهما الأعمال، ويوم الاثنين هو اليوم الذي كانت ولادته فيه، وهو أيضا اليوم الذي أنزل الله فيه عليه الوحي\n"
            }
            "صيام الخميس" -> {
                definition.text = "صوم الاثنين والخميس من أنواع صوم النفل في الإسلام عن عائشة قالت { إن النبي صلَّى اللهُ عليه وسلَّم  كان يتحرى صيام الاثنين والخميس}\n" +
                        "وثبت في مشروعية استحباب صوم يومي الاثنين والخميس دليل الترغيب، وهو أن يومي الاثنين والخميس تعرض فيهما الأعمال، ووجه ذلك: أن الصوم عمل فيستحب للمسلم الصوم فيهما ليعرض عمله وهو صائم، ويدل على هذا حديث: عن أبي هريرة : أن النبي صلَّى اللهُ عليه وسلَّم  قال { تعرض الأعمال كل اثنين وخميس فأحب أن يعرض عملي وأنا صائم } كما ورد أيضا في صوم يوم الاثنين حديث: عن أبي قتادة : أن النبي صلَّى اللهُ عليه وسلَّم  سئل عن صوم يوم الاثنين فقال { ذلك يوم ولدت فيه، وأنزل علي فيه } وفي هذا دليل استحباب صوم يومي الاثنين والخميس؛ لأنهما يومان تعرض فيهما الأعمال، ويوم الاثنين هو اليوم الذي كانت ولادته فيه، وهو أيضا اليوم الذي أنزل الله فيه عليه الوحي\n"
            }
            "الصدقات" -> {
                definition.text = "قال تعالى \" مَّثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنبُلَةٍ مِّائَةُ حَبَّةٍ ۗ وَاللَّهُ يُضَاعِفُ لِمَن يَشَاءُ ۗ وَاللَّهُ وَاسِعٌ عَلِيمٌ\"\n" +
                        "مضاعفة الأجر للمتصدقين: فقد خصّ الله تعالى من ينفقون ويتصدقون من عباده بالأجر المضاعف، وذلك في قوله تعالى: {إِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضاً حَسَناً يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيم}\n" +
                        "وقد جاء الأمر بالصدقة في الجهاد في مواضع كثيرة في كتاب الله ومنها قوله عزّ وجلّ: {انفِرُواْ خِفَافاً وَثِقَالاً وَجَاهِدُواْبِأَموَالِكُمْ وَأَنفُسِكُمْ فِي سَبِيلِ اللهِ ذَلِكُمْ خَيرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ}\n" +
                        "فضل الصدقة على اليتيم: وقد الله تعالى في كتابه العزيز على الصدقة والإنفاق على اليتيم، ومالها من الأجر والفضل، وكان ذلك في قوله تعالى: {فَلا اقتَحَمَ العَقَبَةَ * وَمَا أدرَاكَ مَا العَقَبَةُ* فَكُّ رَقَبَةٍ* أَو إِطعَامٌ فِى يَومٍ ذي مَسغَبَةٍ* يَتِيماً ذَا مَقرَبَةٍ* أَو مِسكِيناً ذَا مَتْرَبةَ}\n" +
                        "مال الصدقة يعود لصاحبه: فقد جاء في آيات قرآنية عن الصدقة أنّ مال الصدقة يرجع لصاحبه، فيطرح الله البركة في مال المتصدق، وكان ذلك في قوله تعالى في سورة سبأ: {قُلْ إِنَّ رَبِّي يَبْسُطُ الرِّزْقَ لِمَنْ يَشَاءُ مِنْ عِبَادِهِ وَيَقْدِرُ لَهُ وَمَا أَنْفَقْتُمْ مِنْ شَيْءٍ فَهُوَ يُخْلِفُهُ وَهُوَ خَيْرُ الرَّازِقِينَ}\n" +
                        "الصدقة تُيسر أعمال الخير على صاحبها: مما رود من آيات عن الصدقة، آيات سورة الليل التي تحدثت عن فضل الصدقة في تيسير الخير والأعمال الصالحة على المتصدقين، والتي تجعلهم من أهل الجنة في الآخرة بإذن الله تعالى، وكان ذلك في قوله تعالى: { فَأَمَّا مَنْ أَعْطَى وَاتَّقَى* وَصَدَّقَ بِالْحُسْنَى* فَسَنُيَسِّرُهُ لِلْيُسْرَى}\n" +
                        "أنّ مما يتمناه الإنسان لحظة الموت أنّه لو كان من المتصدقين، فلحظات الموت عصيبة وثقيلو ومما يخفف من ثقلها على الإنسان الصدقة في سبيل الله، وكان ذلك في قوله تعالى: {وَأَنفِقُوا مِن مَّا رَزَقْنَاكُم مِّن قَبْلِ أَن يَأْتِيَ أَحَدَكُمُ الْمَوْتُ فَيَقُولَ رَبِّ لَوْلَا أَخَّرْتَنِي إِلَىٰ أَجَلٍ قَرِيبٍ فَأَصَّدَّقَ وَأَكُن مِّنَ الصَّالِحِين}\n" +
                        "عن أبى هريرة عن رسول الله صلى الله عليه وسلم قال : ما نقصت صدقة من مال ، وما زاد الله عبدا بعفو إلا عزاً ، وما تواضع أحد لله إلا رفعة الله\n" +
                        "قال صلى الله عليه وسلّم : الصّوم جُنة ، والصدقة تطفيء الخطيئة كما يطفيء الماء النار.\n" +
                        "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال : سبعة يظلهم الله تعالى في ظله يوم لا ظل إلا ظلُّه : إمامٌ عدْلٌ ، وشابٌّ نشأ في عبادة الله ، ورجل قلبه معلَّق في المساجد ، ورجلان تحابَّا في الله اجتمعا عليه وتفرقا عليه ، ورجل دعته امرأة ذات منصب وجمال فقال : إني أخاف الله ، ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه ، ورجل ذكر الله خاليا ففاضت عيناه.\n" +
                        "قول عدي بن حاتم: ذكر النبي صلى الله عليه وسلم النار فأشاح بوجهه - أي صرف وجهه - فتعوذ منها، كرر ذلك مرتين أو ثلاثًا، ثم حض على اتقائها، فقال: (اتقوا النار ولو بشق تمرة، فمن لم يجد فبكلمة طيبة)\n" +
                        "وقد صرح رسول الله صلى الله عليه وسلم بأن إماطة الأذى صدقة، فقال عليه الصلاة والسلام عَنْ أَبِي هُرَيْرَةَ رضي الله عنه: {كُلُّ سُلاَمَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ، يَعْدِلُ بَيْنَ الاِثْنَيْنِ صَدَقَةٌ، وَيُعِينُ الرَّجُلَ عَلَى دَابَّتِهِ فَيَحْمِلُ عَلَيْهَا أَوْ يَرْفَعُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَكُلُّ خُطْوَةٍ يَخْطُوهَا إِلَى الصَّلاَةِ صَدَقَةٌ، وَيُمِيطُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ }\n"
            }
            "صلاتي الشفع و الوتر" -> {
                definition.text = "إنّ حكم صلاة الشفع والوتر الاستحباب وليس الوجوب وقد حافظ النبيّ -صلى الله عليه وسلّم- على هذه الصلاة \n" +
                        "فالشفع معناه لغة الزوج من العدد، ومنه الشافع وهو الذي يكون ثانياً يعزز المشفوع له ويزيل تفرده ويقوي ضعفه، والوتر: الفرد، والشفع والوتر اللذان أقسم الله تعالى بهما في قوله عز من قائل: (والشفع والوتر) [الفجر: 3] اختلف العلماء في المراد بهما، ولعل ما أخرجه الإمام أحمد والنسائي والبزار والحاكم وصححه عن جابر مرفوعاً من أن الوتر يوم عرفة والشفع يوم النحر هو أثبت شيء في تفسيرهما. والوتر في المصطلح الفقهي هو الصلاة التي تختم بها صلاة الليل سميت بذلك لأنها تصلى وتراً أي ركعة واحدة أو ثلاثاً أو نحو ذلك لما ثبت في صحيح مسلم عن عائشة رضي الله تعالى عنها \" أن النبي صلى الله عليه وسلم كان يصلي من الليل ثلاث عشرة ركعة يوتر من ذلك بخمس لا يجلس في شيء إلا في آخرها. \" هذا إذا لم يفصل بين الركعة الأخيرة وبين ما قبلها بسلام، للحديث المتقدم، فإن فصل بينها وبين ما قبلها بسلام كان الوتر اسماً للركعة المفصولة وحدها، وكان ما قبلها شفعاً سواء كان ركعتين أو أربعاً أو ستاً أو أكثر، لقوله صلى الله عليه وسلم لمن سأله عن صلاة الليل: \"مثنى مثنى، فإذا خشي أحدكم الصبح صلى ركعة واحدة توتر له ما قد صلى\". الحديث متفق عليه.\n" +
                        "وقد يراد بالشفع الركعتان اللتان تسبقان الوتر فقط وهما اللتان يقرأ فيهما بالأعلى والكافرون. والله أعلم\n" +
                        "وقد ورد ذكر كلمتي الشفع والوتر فيما رواه سالمٍ بن عبد الله بن عمر: \"عن ابنِ عمرَ أنه كان يفصلُ بينَ شفعِه ووترِه بتسليمةٍ وأخبر ابنُ عمرَ أنَّ النبيَّ -صلَّى اللهُ عليهِ وسلمَ- كان يفعلُ ذلك\"\n" +
                        "\n" +
                        "رسولُ اللَّهِ ﷺ قالَ: إنَّ اللَّه وِترٌ يُحِبُّ الْوتْرَ، فأَوْتِرُوا، يَا أَهْلَ الْقُرْآنِ\n" +
                        "ويقول ﷺ : من خاف أن لا يقوم من آخر الليل فليوتر أوله، ومن طمع أن يقوم آخر الليل فإن صلاة آخر الليل مشهودة وذلك أفضل\n" +
                        "صلاة الوتر في الإسلام نوع من أنواع صلاة النفل، تُصلّى بالليل. وهي: ركعة تختم صلاة الليل التي تصلى قبلها شفعا وحكمها: سنة مؤكدة عند الجمهور، وواجبة عند الحنفية. وهي: الركعة وما يضاف قبلها من صلاة الليل مثنى مثنى. وأكثر الوتر إحدى عشرة ركعة، وأقله ثلاث ركعات، أو ركعة تختم شفعا من الصلاة قبلها. يدخل وقتها بفعل صلاة العشاء، ويستمر إلى طلوع الفجر الثاني\n" +
                        "سميت بذلك لأنها تُصلى وتراً أي ركعة واحدة، أو ثلاثاً أو أكثر اي عدداً فردياً\n" +
                        "اتفق الفقهاء على أن وقته من بعد صلاة العشاء إلى طلوع الفجر، كما اتفقوا على أن أفضل وقته هو السحور\n" +
                        "وعن جابر رضي الله عنه قال: قال رسول الله صلَّى اللهُ عليه وسلَّم  : \n" +
                        "من خاف أن لا يقوم من آخر الليل فليوتر أوله، ومن طمع أن يقوم آخره فليوتر آخر الليل فإن صلاة آخر الليل مشهودة وذلك أفضل\n"
            }
            "صلاة تحية المسجد" -> {
                definition.text = "عَنْ أَبِي قَتَادَةَ السَّلَمِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِذَا دَخَلَ أَحَدُكُمُ المَسْجِدَ فَلْيَرْكَعْ رَكْعَتَيْنِ قَبْلَ أَنْ يَجْلِسَ» [1]. وعَنْ جَابِرِ بْنِ عَبْدِ اللهِ، قَالَ: كَانَ لِي عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ دَيْنٌ، فَقَضَانِي وَزَادَنِي، وَدَخَلْتُ عَلَيْهِ الْمَسْجِدَ، فَقَالَ لِي: «صَلِّ رَكْعَتَيْنِ».[2] وعنه رضي الله عنه، قَالَ: جَاءَ رَجُلٌ وَالنَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ يَوْمَ الْجُمُعَةِ يَخْطُبُ، فَقَالَ لَهُ «أَرَكَعْتَ رَكْعَتَيْنِ؟» قَالَ: لَا، فَقَالَ: «ارْكَعْ».[3] وفي رواية: جَاءَ سُلَيْكٌ الْغَطَفَانِيُّ يَوْمَ الْجُمُعَةِ، وَرَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَخْطُبُ، فَجَلَسَ، فَقَالَ لَهُ: «يَا سُلَيْكُ قُمْ فَارْكَعْ رَكْعَتَيْنِ، وَتَجَوَّزْ فِيهِمَا».  ثُمَّ قَالَ: «إِذَا جَاءَ أَحَدُكُمْ يَوْمَ الْجُمُعَةِ، وَالْإِمَامُ يَخْطُبُ، فَلْيَرْكَعْ رَكْعَتَيْنِ، وَلْيَتَجَوَّزْ فِيهِمَا».[4]\n"
            }
            "صيام يوم عرفه" -> {
                definition.text = "ليوم عرفة فضل عظيم، وقد وردت أحاديث عدة تبين هذا الفضل؛ ففى \"صحيح مسلم\" عن أبى قتادة رضى الله عنه عن النبى صلى الله عليه وآله وسلم قال: «صيام يوم عرفة أحتسب على الله أن يكفر السنة التى قبله والسنة التى بعده». ومعنى الحديث أن صيام يوم عرفة يكفر ذنوب السنة الماضية، ويحول بين صائمه وبين الذنوب فى السنة الآتية .\n" +
                        "\n" +

                        "\n" +
                        "وقد ثبت عن النبى صلى الله عليه وآله وسلم أنه كان يصوم التسع الأول من ذى الحجة؛ فروى أبو داود وغيره عن بعض أزواج النبى صلى الله عليه وآله وسلم قالت: \"كان رسول الله صلى الله عليه وآله وسلم يصوم تسع ذى الحجة، ويوم عاشوراء، وثلاثة أيام من كل شهر أول اثنين من الشهر، والخميس\".\n" +
                        "\n" +

                        "\n" +
                        "فضل صيام يوم عرفة\n" +
                        "وروى النسائى عن حفصة رضى الله عنها قالت: \"أربع لم يكن يدعهن النبى صلى الله عليه وآله وسلم: صيام عاشوراء، والعشر، وثلاثة أيام من كل شهر، وركعتين قبل الغداة\".\n" +
                        "\n" +

                        "\n" +
                        "وأما صوم يوم عرفة بخصوصه فمستحب لغير الحاج، ويكره صيامه للحاج أن كان يضعفه الصوم عن الوقوف والدعاء؛ جاء فى \"تحفة الفقهاء\" [وأما صوم يوم عرفة فى حق الحاج: فإن كان يضعفه عن الوقوف بعرفة ويخل بالدعوات فإن المستحب له أن يترك الصوم؛ لأن صوم يوم عرفة يوجد فى غير هذه السنة، فأما الوقوف بعرفة فيكون فى حق عامة الناس فى سنة واحدة، وأما إذا كان لا يخالف الضعف فلا بأس به، وأما فى حق غير الحاج فهو مستحب؛ لأن له فضيلة على عامة الأيام] .\n" +
                        "\n" +

                        "\n" +
                        "حجاج بيت الله الحرام وصيام يوم عرفة:\n \n" +
                        "وجاء فى \"بدائع الصنائع فى ترتيب الشرائع\" : [ وأما صوم يوم عرفة: ففى حق غير الحاج مستحب؛ لكثرة الأحاديث الواردة بالندب إلى صومه، ولأن له فضيلة على غيره من الأيام، وكذلك فى حق الحاج أن كان لا يضعفه عن الوقوف والدعاء؛ لما فيه من الجمع بين القربتين، وإن كان يضعفه عن ذلك يكره؛ لأن فضيلة صوم هذا اليوم مما يمكن استدراكها فى غير هذه السنة ]"
                name_text.visibility = View.INVISIBLE
                numofdays.visibility = View.INVISIBLE
                start_but.visibility = View.INVISIBLE

            }
            "صيام يوم عاشوراء" -> {
                definition.text = "يعتبر اليوم العاشر من شهر محرّم هو يوم عاشوراء عند المسلمين، وهو من الأيّام المستحبّ صيامها عند أكثر أهل العلم، وقد ورد في ذلك الكثير من الأحاديث التي تذكر فضل يوم عاشوراء وأجر صيامه، وسنذكر في هذا المقال سبب صيام المسلمين ليوم عاشوراء، وفضل ذلك عند الله سبحانه وتعالى.\n" +
                        "فقد روى البخاري ومسلم عن ابن عباس رضي الله عنهما قال: (قدم النّبي - صلّى الله عليه وسلّم - المدينة فرأى اليهود تصوم يوم عاشوراء، فقال: ما هذا؟ قالوا: هذا يوم صالح، هذا يوم نجّى الله بني إسرائيل من عدوّهم، فصامه موسى - عند مسلم شكراً - فقال رسول الله صلّى الله عليه وسلّم: فأنا أحقّ بموسى منكم، فصامه وأمر بصيامه). (3) وعن عائشة رضي الله عنها قالت: (كان يوم عاشوراء يوماً تصومه قريش في الجاهلية، وكان رسول الله - صلّى الله عليه وسلّم - يصومه، فلمّا قدم المدينة صامه، وأمر النّاس بصيامه، فلمّا فرض رمضان قال: من شاء صامه ومن شاء تركه) رواه البخاري ومسلم ، وعن معاوية بن أبي سفيان رضي الله عنه قال: سمعت رسول الله - صلّى الله عليه وسلّم - يقول: (إنّ هذا يوم عاشوراء، ولم يكتب عليكم صيامه، وأنا صائم فمن شاء صام، ومن شاء فليفطر) رواه البخاري ومسلم .\n"

                name_text.visibility = View.INVISIBLE
                numofdays.visibility = View.INVISIBLE
                start_but.visibility = View.INVISIBLE
            }
            //sonan mahgora------------------------
            "أن ينفض الفراش قبل النوم" -> {
                definition.text = "قال ( إذا أوى أحدكم إلى فراشه فلينفض فراشه بداخله إزاره فإنه لا يدري ما خلفه عليه ، ثم ليضطجع على شقه الأيمن ، ثم ليقل : باسمك ربي وضعت جنبي ، وبك أرفعه ، إن أمسكت نفسي فارحمها ، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين ) صحيح أبي داود\n"
            }
            "شرب الماء جالساً" -> {
                definition.text = "عَنْ أَنَسٍ وأَبِي سَعِيدٍ الْخُدْرِيِّ رضي الله عنهما أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ زَجَرَ ( في لفظ : نَهَى) عَنْ الشُّرْبِ قَائِمًا . أخرجه مسلم"
            }
            "البدء باليمين في لبس الملابس" -> {
                definition.text = "( كان رسول الله صلى الله عليه وسلم إذا لبس قميصا بدأ بميامنه ) صحيح الترمذي"
            }
            "الاستغفار للوالدين" -> {
                definition.text = " عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: َقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَآلِهِ وَسَلَّمَ: “إِنَّ الرَّجُلَ لَتُرْفَعُ دَرَجَتُهُ فِي الْجَنَّةِ فَيَقُولُ: أَنَّى لِي هَذَا؟ فَيُقَالُ: بِاسْتِغْفَارِ وَلَدِكَ لَكَ”. صحيح ابن ماجه \n"
            }
            "الذكر الوارد بعد الوتر" -> {
                definition.text = "جاء في الحديث ( وإذا سلَّمَ من الوترِ، قال سبحانَ الملِكِ القدُّوسِ سبحانَ الملِكِ القدُّوسِ سبحانَ الملِكِ القدُّوسِ، ثلاثًا ويمدُّ بِها صوتَه، ويرفعُ في الثالثة )\n" +
                        "صحيح أبي داود \n"
            }
            "المضمضه والاستنشاق بكف واحده" -> {
                definition.text = " (عن عبد الله بن زيد – رضي الله عنه- في صفة وضوء رسول الله صلى الله عليه وسلم : « أنه أفرغ من الإناء على يديه فغسلهما ثم غسل أو مضمض واستنشق من كف واحدة ففعل ذلك ثلاثاً… ثم قال: هكذا وضوء رسول الله – صلى الله عليه وسلم- » أخرجه البخاري \n"

            }
            "ملازمة السواك" -> {
                definition.text = "النبي صلى الله عليه وسلم قال : \" لولا أن أشق على أمتي لأمرتهم بالسواك عند كل صلاة \" رواه البخاري (2/299) ومسلم (1/151) . وفي رواية للبخاري : \" عند كل وضوء \" ."
            }
            "محاسبة النفس" -> {
                definition.text = "قَالَ تَعَالَى: {يَا أَيُّهَا الَّذِينَ آمَنُوا اتَّقُوا اللَّهَ وَلْتَنظُرْ نَفْسٌ مَّا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُون} [الحشر:18]\n" +
                        "فأما النوع الأول: فهو أن يقف عند أول همه وإرادته فينظر: هل العمل موافقٌ لكتاب الله وسنة رسوله صلى اللهُ عليه وسلم أم لا؟ فإن كان موافقًا أقدم، وإن كان مخالفًا ترك، ثم ينظر: هل فعله خير له من تركه؟ أو تركه خير له من فعله؟ فإن كان الثاني: تركه ولم يقدم عليه، ثم ينظر: فإن كان لله مضى، وإن كان للجاه، والثناء، والمال من المخلوق ترك. أما النوع الثاني: فهو محاسبة النفس بعد العمل وهو ثلاثة أنواع: أولًا: محاسبتها على طاعة قصرت فيها من حق الله تعالى فلم توقعها على الوجه الذي ينبغي، وحق الله في الطاعة ستة أمور: الإخلاص لله في العمل، النصيحة لله فيه، متابعة الرسول صلى اللهُ عليه وسلم، شهود مشهد الإحسان فيه، شهود منة الله عليه، شهود تقصيره فيه، بعد ذلك كله يحاسب نفسه هل وَفَّى هذه المقامات حقها؟ وهل أتى بها في هذه الطاعة؟ ثانيًا: أن يحاسب نفسه على المناهي، فإن عرف أنه ارتكب منها شيئًا تداركه بالتوبة، والاستغفار، والحسنات الماحية. ثالثًا: أن يحاسب نفسه على كل عمل كان تركه خيرًا من فعله. رابعًا: أن يحاسب نفسه على أمر مباحٍ، أو معتادٍ، لم فعله؟ وهل أراد به الله والدار الآخرة؟ فيكون رابحًا، أو أراد به الدنيا وعاجلها؟ فيخسر ذلك الربح ويفوته الظفر (إغاثة اللهفان [1/ 148-149]).\n" +
                        "\n" +
                        "قَالَ عمر بن الخطاب رضي اللهُ عنه: \"حَاسِبُوا أَنفُسَكُم قَبلَ أَن تُحَاسَبُوا، وَزِنُوا أَنفُسَكُم قَبلَ أَن تُوزَنُوا، فَإِنَّهُ أَهوَنُ عَلَيكُم فِي الحِسَابِ غَدًا، أَن تُحَاسِبُوا أَنفُسَكُمُ اليَومَ، وَتَزَيَّنُوا لِلعَرضِ الأَكبَرِ، يَومَئِذٍ تُعرَضُونَ لَا تَخفَى مِنكُم خَافِيَةٌ\" (إغاثة اللهفان [1/ 145]).\n"
            }
            "صلاة الاستخارة" -> {
                definition.text = "عَنْ جَابِرٍ رضي الله عنه قَالَ: كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا الاسْتِخَارَةَ فِي الأُمُورِ كُلِّهَا كَمَا يُعَلِّمُنَا السُّورَةَ مِنْ الْقُرْآنِ يَقُولُ:\n" +
                        "\n" +
                        "إذَا هَمَّ أَحَدُكُمْ بِالأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ ثُمَّ لِيَقُلْ: (اللَّهُمَّ إنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ فَإِنَّكَ تَقْدِرُ وَلا أَقْدِرُ، وَتَعْلَمُ وَلا أَعْلَمُ، وَأَنْتَ عَلامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ (هنا تسمي حاجتك) خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ: عَاجِلِ أَمْرِي وَآجِلِهِ، فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، اللَّهُمَّ وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ (هنا تسمي حاجتك) شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي أَوْ قَالَ: عَاجِلِ أَمْرِي وَآجِلِهِ، فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ ارْضِنِي بِهِ. وَيُسَمِّي حَاجَتَهُ) وَفِي رواية ثُمَّ رَضِّنِي بِهِ (رَوَاهُ الْبُخَارِيُّ)"
            }
            "اذكار الصباح و المساء" -> {
                definition.text = "قال الله تعالى: (فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُوا لِي وَلَا تَكْفُرُونِ) [البقرة: 152]، أمر الله تعالى عباده بذكره والإكثار منه، فذكر الله تعالى عبادةٌ عظيمة وسهلة وخفيفة، فهي لا تحتاج لبذل مجهودٍ عقلي ولا عضلي، إنّما هي تحريك اللسان مع حضور القلب والعقل،\n" +
                        "فضل قراءة أذكار الصباح والمساء كسب رضا الله عزّ وجلّ ، زيادة قوة الإيمان بالله سبحانه وتعالى ، دوام الصلة بالله عزّ وجلّ والقرب منه والأنس به ، ذكر الله عزّ وجلّ للعبد في الملأ الأعلى ، الحفظ من شر الإنس والجنّ وشر كلّ المخلوقات ، التمتع بحفظ الله عزّ وجلّ وحمايته. مغفرة الذنوب والسيئات ، زيادة الحسنات والثواب ، دخول الجنة بفضل الله وكرمه ، دوام نعم الله جلّ وعلا والبركة فيها ، كفاية الهم والغم والحزن في الدنيا والآخرة ، طمأنينة القلب وانشراح الصدر ، التحصن من الشيطان ومكائده ، الحفظ من الحسد والعين ، إمداد الجسم بالقوة والطاقة ، جلب الرزق وقضاء الدين ، حفظ المكان الذي يبيت فيه الإنسان\n"
            }
            "الجلوس فى المصلى بعد الفجر" -> {
                definition.text = "ورد عن النبي صلى الله عليه وسلم أحاديث نبوية كثيرة تشير إلى فضل التعبد بعد أداء صلاة الفجر، وأهمها ما ورد في الحديث: (مَن صلى الفجرَ في جماعةٍ، ثم قَعَد يَذْكُرُ اللهَ حتى تَطْلُعَ الشمسُ، ثمّ صلى ركعتينِ، كانت له كأجرِ حَجَّةٍ وعُمْرَةٍ تامَّةٍ ، تامَّةٍ ، تامَّةٍ)\n"
            }
        }


        //end control

        start_but.setOnClickListener {
            myshared = getSharedPreferences("shared", 0)
            myshared1 = getSharedPreferences("keyshared", 0)

            var editor: SharedPreferences.Editor = myshared!!.edit()
            var editor1: SharedPreferences.Editor = myshared1!!.edit()

            //declaring initial variables

            var startdate = java.util.Calendar.getInstance().time.toString()
            var num_days_: String = numofdays.text.toString()
            var num_days = translate(num_days_)


            var numcoins: String = "0"
            var rating: Float = 0.0f
            var checkstate: String = "false"

            //3ak
            if (num_days_.isNotEmpty() && num_days.toIntOrNull() != null) {
                if (num_days.toInt() > 0) {

                    when (s) {
                        "الصلاوات الخمس" -> {
                            //putting variables in shared pref by using key and value method
                            editor.putString("الفجر", "الفجر" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)


                            //editor.putString("keys" , s+",")
                            editor.putString("الظهر", "الظهر" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)

                            editor.putString("العصر", "العصر" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)


                            editor.putString("المغرب", "المغرب" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)


                            editor.putString("العشاء", "العشاء" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)

                            editor.commit()

                            //editor 1
                            var temp = getdataback_slicedform("keyshared")
                            if (temp == null)
                                temp = "الفجر,الظهر,العصر,المغرب,العشاء" + ","
                            else temp = temp + "الفجر,الظهر,العصر,المغرب,العشاء" + ","
                            editor1.putString("keys", temp)
                            editor1.commit()

                        }
                        "السنن الرواتب" -> {
                            //putting variables in shared pref by using key and value method
                            editor.putString("سنة الفجر", "سنة الفجر" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)


                            //editor.putString("keys" , s+",")
                            editor.putString("سنة الظهر", "سنة الظهر" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)

                            editor.putString("سنة العصر", "سنة العصر" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)


                            editor.putString("سنة المغرب", "سنة المغرب" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)


                            editor.putString("سنة العشاء", "سنة العشاء" + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)

                            editor.commit()

                            //editor 1
                            var temp = getdataback_slicedform("keyshared")
                            if (temp == null)
                                temp = "سنة الفجر,سنة الظهر,سنة العصر,سنة المغرب,سنة العشاء" + ","
                            else temp = temp + "سنة الفجر,سنة الظهر,سنة العصر,سنة المغرب,سنة العشاء" + ","
                            editor1.putString("keys", temp)
                            editor1.commit()
                        }
                        else -> {
                            //putting variables in shared pref by using key and value method
                            editor.putString(s, s + "," + startdate + "," + numcoins + "," + rating.toString() + "," + "false"
                                    + "," + num_days)


                            var temp = getdataback_slicedform("keyshared")
                            if (temp == null)
                                temp = s + ","
                            else temp = temp + s + ","
                            editor1.putString("keys", temp)
                            editor1.commit()


                            //editor.clear()
                            editor.commit()
                        }
                    }


                    val intent = Intent(this, MyChallengesActivity::class.java)
                    intent.putExtra("startdate", startdate)
                    startActivity(intent)

                }
            }
        }


    }


    fun calc_day(x: Date): Int {
        val curr = java.util.Calendar.getInstance().time
        var diff = curr.time - x.time
        return ((diff / (1000 * 3600 * 24)).toInt() + 1)

    }

    fun getdataback_slicedform(s: String): String? {
        var databack = getSharedPreferences(s, 0)
        var m: MutableMap<String, String>
        m = databack.all as MutableMap<String, String>

        var keys: MutableMap<String, String> = databack.all as MutableMap<String, String>

        val thestring: String? = keys["keys"]
        return thestring
        /*val temp = thestring?.substring(0,thestring.len1gth-1)
        val valuesinOrder = temp?.split(",")?.toTypedArray()
        return valuesinOrder*/
    }

    fun translate(s: String): String {
        var m: MutableMap<String, String> = mutableMapOf("١" to "1", "٢" to "2", "٣" to "3", "٤" to "4", "٥" to "5", "٦" to "6", "٧" to "7", "٨" to "8", "٩" to "9", "٠" to "0")
        var res: String = ""
        for (c in s) {
            var temp: String = c.toString()
            if (m.containsKey(temp)) {
                res += m[temp]
            } else res += temp
        }
        return res
    }


}

